000001  IDENTIFICATION DIVISION.
000002      PROGRAM-ID. HELLO.
000003  PROCEDURE DIVISION.
000004          DISPLAY "¡Hola Mundo desde COBOL!".
000005
000006          STOP RUN.
000007 END PROGRAM HELLO.
